Repository: IceNox-GmbH/woocommerce-icenox-pay-plugin
Catalog: languages/woocommerce-icenox-pay-plugin-*.po
Languages: de_de

source: IceNox Pay Payment
de_de: Zahlung mit IceNox Pay

source: Enable/Disable
de_de: Aktivieren/Deaktivieren

source: Enable Payment Method
de_de: Zahlungsmethode aktivieren

source: Method Title
de_de: Name der Methode

source: The title of the payment method which will show to the user on the checkout page.
de_de: Der Titel der Zahlungsmethode, der auf der Checkout-Seite angezeigt wird.

source: Method Logo
de_de: Logo der Zahlungsmethode

source: URL for the payment method that will show to the user on the checkout page.
de_de: Logo URL für die Zahlungsmethode, die auf der Checkout-Seite angezeigt wird.

source: Method Description
de_de: Zahlungsmethoden Beschreibung

source: Description for the payment method that will show to the user on the checkout page.
de_de: Beschreibung für die Zahlungsmethode, die auf der Checkout-Seite angezeigt wird.

source: Payment Fee in %
de_de: Zahlungsgebühr in %

source: Add an additional payment fee for this payment method.
de_de: Fügen Sie eine zusätzliche Zahlungsgebühr für diese Zahlungsmethode hinzu.

source: Method Settings
de_de: Zahlungsmethoden Einstellungen

source: API Key
de_de: API-Schlüssel

source: API Key for IceNox Pay.
de_de: API-Schlüssel für IceNox Pay.

source: Payment Method Identifier
de_de: Zahlungsmethoden Identifier

source: Payment Method Identifier for IceNox Pay.
de_de: Zahlungsmethoden Identifier für IceNox Pay.

source: Express Redirect
de_de: Express Weiterleitung

source: Redirect immediately to the payment (only available for selected payment methods)
de_de: Direkt zur Zahlung weiterleiten (nur für bestimmte Zahlungsmethoden verfügbar)

source: Enable Debug Mode
de_de: Debug-Modus aktivieren

source: Enable
de_de: Aktivieren

source: If debug mode is enabled, the payment gateway will be activated just for the administrator. You can use the debug mode to make sure that the gateway works as expected.
de_de: Wenn der Debug-Modus aktiviert ist, wird die Zahlungsmethode nur für Administrator aktiviert. Sie können den Debug-Modus verwenden, um sicherzustellen, dass die Zahlungsmethode wie erwartet funktioniert.

source: There was a problem redirecting you to the Payment Gateway. Please try again or contact our support.
de_de: Bei der Weiterleitung zum Zahlungsgateway ist ein Problem aufgetreten. Bitte versuchen Sie es erneut oder wenden Sie sich an unseren Support.

source: Payment Method Fee
de_de: Zahlungsgebühr

source: There is a new version of %1$s available. %2$sView version %3$s details%4$s.
de_de: Es ist eine neue Version von %1$s verfügbar. %2$sDetails zu Version %3$s ansehen%4$s.

source: There is a new version of %1$s available. %2$sView version %3$s details%4$s or %5$supdate now%6$s.
de_de: Es ist eine neue Version von %1$s verfügbar. %2$sDetails zu Version %3$s ansehen%4$s oder %5$sjetzt aktualisieren%6$s.

source: You do not have permission to install plugin updates
de_de: Du hast keine Berechtigung, um Aktualisierungen für Plugins durchzuführen

source: Error
de_de: Fehler

source: Credit Card or Debit Card
de_de: Kredit- oder Debitkarte

source: IceNox Pay Method
de_de: IceNox Pay Zahlungsmethode

source: Payment Processor
de_de: Zahlungsdienstleister

source: Please select your Payment Service Provider to process card payments.
de_de: Bitte wählen Sie Ihren Zahlungsdienstleister für Kartenzahlungen aus.

source: Express Checkout Settings
de_de: Express Checkout Einstellungen

source: Please select which Express Checkout Buttons you would like to show.
de_de: Bitte wählen Sie aus, welche Express Checkout Buttons Sie anzeigen möchten.

source: Button Placement
de_de: Platzierung der Buttons

source: Please select where you would like the selected Express Checkout Buttons to be shown.
de_de: Bitte wählen Sie aus, wo die ausgewählten Express Checkout Buttons angezeigt werden sollen.

source: Cart
de_de: Warenkorb

source: Checkout
de_de: Kasse

source: Button Appearance
de_de: Aussehen der Buttons

source: Please select how the Express Checkout Buttons should appear. White is recommended for dark websites.
de_de: Bitte wählen Sie aus, wie die Express Checkout Buttons dargestellt werden sollen. Weiß wird für Webseiten mit dunklem Design empfohlen.

source: Black
de_de: Schwarz

source: White
de_de: Weiß

source: White with outline
de_de: Weiß mit Rahmen

source: Merchant Name
de_de: Händlername

source: This Name is shown in the Button Interface as "Paid to [Merchant Name]"
de_de: Dieser Name wird in der Schaltflächenoberfläche als "Zahlung an [Händlername]" angezeigt.

source: Accepted Card Brands
de_de: Akzeptierte Kartenmarken

source: Please select which Cards Brands you accept. (Maybe check with your PSP or contact our support to find out which brands you can accept.)
de_de: Bitte wählen Sie aus, welche Kartenmarken Sie akzeptieren. (Erkundigen Sie sich bei Ihrem Zahlungsdienstleister oder wenden Sie sich an unseren Support, um herauszufinden, welche Marken Sie akzeptieren können.)

source: Google Pay Merchant ID
de_de: Google Pay Händler-ID

source: Please select your Payment Service Provider to process Express Checkout Payments.
de_de: Bitte wählen Sie Ihren Zahlungsdienstleister für Express Checkout Zahlungen aus.

source: Please select your Payment Service Provider to process PayPal payments.
de_de: Bitte wählen Sie Ihren Zahlungsdienstleister für PayPal-Zahlungen aus.

source: IceNox Pay Settings
de_de: IceNox Pay Einstellungen

source: Please enter your IceNox Pay API Key. The API Key can be found in the Merchant Dashboard.
de_de: Bitte geben Sie Ihren IceNox Pay API Key ein. Den API-Schlüssel finden Sie im Händler-Dashboard.

source: Merchant ID
de_de: Händler-ID

source: Will be filled in automatically
de_de: Wird automatisch ausgefüllt

source: Optional Features
de_de: Optionale Features

source: Include Cancel URL
de_de: Abbruch-URL hinzufügen

source: Add a Cancel Button on the Payment Page. The customer can then return to the checkout to select a different payment method.
de_de: Auf der Zahlungsseite einen "Abbrechen"-Button hinzufügen. Der Kunde kann damit zur Kasse zurückkehren, um eine andere Zahlungsmethode auszuwählen.

source: Fee Calculation
de_de: Zahlungsgebühren

source: Add optional fees to selected payment methods.
de_de: Fügen Sie eine zusätzliche Zahlungsgebühr für ausgewählte Zahlungsmethoden hinzu.

source: Advanced Mode
de_de: Erweiterter Modus

source: Enable the Advanced mode to add custom payment methods or add the same payment method with a different PSP.
de_de: Aktivieren Sie den erweiterten Modus, um benutzerdefinierte Zahlungsmethoden, oder dieselbe Zahlungsmethode über einen anderen PSP hinzuzufügen.

source: Add or Remove Payment Methods
de_de: Zahlungsmethoden hinzufügen oder entfernen

source: Payment Methods
de_de: Zahlungsmethoden

source: Select which IceNox Pay Methods you would like to use.
de_de: Wählen Sie aus, welche IceNox-Zahlungsmethoden Sie verwenden möchten.

source: Custom Method
de_de: Benutzerdefinierte Zahlungsmethode

source: Enter the name of the payment method then click on Save Changes.
de_de: Geben Sie den Namen der Zahlungsmethode ein und klicken dann auf Änderungen speichern.

source: Available Payment Methods
de_de: Verfügbare Zahlungsmethoden

source: Payment Method
de_de: Zahlungmethode

source: Processor
de_de: Zahlungsdienstleister

source: Created By
de_de: Erstellt von

source: Actions
de_de: Aktionen

source: Enabled
de_de: Aktiviert

source: Yes
de_de: Ja

source: Disabled
de_de: Deaktiviert

source: No
de_de: Nein

source: Configure
de_de: Konfigurieren

source: Delete
de_de: Löschen

source: IceNox Pay Payment Settings
de_de: IceNox Pay Zahlungsmethoden Einstellungen

source: Settings
de_de: Einstellungen

source: Merchant Dashboard
de_de: Händler-Dashboard

source: Payment Fee
de_de: Zahlungsgebühr

source: Connect your WooCommerce Store with IceNox Pay. The payment system for your online shop.
de_de: Verbinden Sie Ihren WooCommerce-Shop mit IceNox Pay. Das Zahlungssystem für Ihren Online-Shop.

source: https://icenox.com/
de_de: https://icenox.de/
